var router = [
	{
		"bookList": ["楚文字編","馬王堆簡帛文字編","秦簡牘文字彙編","秦印文字彙編","睡虎地秦簡文字編","古文字類編(增訂本)","簡牘帛書字典","中國草書大字典","中國隸書大字典","古文字通假字典","戰國秦漢簡帛古書通假字彙纂","甲骨文字編","新金文編","侯馬盟書字表","傳抄古文字編","秦簡文字編","銀雀山漢簡文字編","張家山漢簡文字編","上博藏戰國楚竹書字匯","上海博物館藏戰國楚竹書(八)文字編","浙江大學藏戰國楚簡","新甲骨文編","古文字詁林","中國正書大字典","中國行書大字典","關沮秦簡文字編","秦簡牘文字編","長沙走馬樓三國吳簡‧竹簡(貳)文字編","武威漢代醫簡文字編","說文新證2010","新蔡葛陵楚簡文字編","清華大學藏戰國竹簡(壹)","秦封泥文字編","嶽麓秦簡字形比對表","秦漢金文字匯","魏晉南北朝簡牘文字構形分析表","張家山漢簡‧二年律令文字編","古老子文字編","秦文字編_劉孝霞","出土秦漢小篆文字編","漢代銅鏡銘文文字編","漢代銅印文字編","漢代篆文編","宋代石刻篆文編","香港中文大學文物館藏簡牘字形表","金石大字典","漢簡文字類編","秦文字疏證","陶文字典","長沙走馬樓三國吳簡文字編","漢代陶文文字編","三晉文字編","燕文字編","戰國文字編","清華大學藏戰國竹簡(壹-參)文字編","字源","上海博物館藏戰國楚竹書(九)文字編_李敏","清華大學藏戰國竹簡(肆)","齊文字編","漢代銅器銘文綜合研究","楚簡帛通假彙釋","新見金文字編","額濟納漢簡文字編","漢魏六朝碑刻異體字典","齊魯文字編","嶽麓書院藏秦簡(壹)文字編","嶽麓書院藏秦簡(貳)文字編","漢代銅器銘文文字編","肩水金關漢簡(壹)文字編","嶽麓書院藏秦簡(參)文字編","嶽麓書院藏秦簡(三)文字編","居延新簡文字編","居延舊簡文字編","高臺、關沮、胥浦漢墓簡牘文字編","古陶字錄","漢代簡牘草字彙編","訂正六書通","中國磚銘文字徵","秦漢魏晉篆隸字形表","木簡字典","漢魏六朝隋唐五代字形表","上海博物館藏戰國楚竹書(九)文字編_陳茜","齊系文字編","漢代漆器銘文文字編","敦煌俗字譜","吳越文字彙編","北京大學藏西漢竹書(貳)文字編_沈柏汘","古瓦當文編","先秦貨幣文字編","中國磚瓦陶文大字典","秦文字編_王輝","戰國古文字典","尹灣漢簡文字編","漢印文字徵","漢印文字徵補遺","漢印文字匯編","甲金篆隸大字典","石刻篆文編","金文常用字典","古陶字彙","故訓匯纂","王力古漢語字典","古籀彙編","鳥蟲書字彙","清華大學藏戰國竹簡(伍)","里耶秦簡(壹)文字編","上博楚簡文字聲系(一-八)","北京大學藏西漢竹書(貳)文字編_任秋芬","武威儀禮漢簡文字編","文字析義注","中國楷書大字典","漢人所謂古文之研究","簡化字源","中山王厝器文字編","《汗簡》《古文四聲韻》新證","敦煌俗字典","宋元以來俗字譜","古漢語常用字字典","碑別字新編","廣碑別字","《尚書》古文字編","鄭玄辭典","敦煌變文字義通釋","包山楚墓文字全編","敦煌文獻語言詞典","詩詞曲語辭匯釋","中國異體字大系(楷書編)","中國異體字大系(隸書編)","中國異體字大系(篆書編)","傳抄古文綜合研究","說文新證2014","魏石經古文彙編(未刊稿)","中國書法大字典(草書卷)","中國書法大字典(行書卷)","中國書法大字典(楷書卷)","中國書法大字典(隸書卷)","中國書法大字典(篆書卷)","大書源","新甲骨文編(增訂本)","《古文四聲韻》古文研究","日藏唐代漢字抄本字形表","傳鈔古文《尚書》文字辨析","戰國文字編(修訂本)","張家山漢簡文字編_2015","《上海博物館藏戰國楚竹書(一-六)》通假字研究","楚系簡帛文字編(增訂本)","清華大學藏戰國竹簡(陸)","清華大學藏戰國竹簡(柒)","肩水金關漢簡文字編","新編《睡虎地秦簡牘》文字編","尹灣漢墓簡牘字表","甲骨文詞譜","中國漢字文物大系","北京大學藏西漢竹書字表","鳥蟲篆全書","甲骨文字詁林","甲骨文字詁林補編","肩水金關漢簡(參)文字編","甲骨文字典","金文考釋匯纂(1990-1999)","傳抄古文新編字編","金文詁林","古文異體關係整理與研究","古文字譜系疏證","金文文字考釋匯纂(2000-2015)","戰國楚系簡帛用字習慣研究","嶽麓書院藏秦簡(壹-參)文字編","侯馬盟書文字編","侯馬盟書字表新編","商金文編","戰國時代各系文字間的用字差異現象研究","甲骨文虛詞詞典","汗簡注釋","金文詁林補","簡明金文詞典","古文字釋要","漢印文字字形表","金文形義通解","金文形義通解訂補","宋元明市語彙釋","簡帛古書通假字大系","曾侯乙墓竹簡文字編","曾文字編","遠流活用成語辭典","非簡帛類戰國文字通假材料的整理與研究","出土《蒼頡篇》字表","清華大學藏戰國竹簡(捌)","字統","商代金文全編","西周文字字形表","里耶秦簡文字編","春秋文字字形表","中國璽印類編","《說文》古文研究","佛教難字字典","《可洪音義》異體字表","韓國漢文古文獻異形字譜","韓國漢文古文獻異形字研究之異形字典","隸定古文疏證","簡化漢字解說","明清小說俗字典","漢簡語彙‧中國古代木簡辭典","秦文字字形表","長沙五一廣場東漢簡牘(壹)異體字表","漢代文字編","長沙五一廣場東漢簡牘(貳)異體字表","秦漢簡帛文獻與《說文解字》新證","上古音手冊(增訂本)","漢字古音手冊(增訂本)","漢字字音演變大字典","詩詞曲語辭例釋","詩詞曲語辭辭典","歷代避諱字彙典","同源字典","漢字通用聲素研究","文源","甲骨金文字典","增廣鐘鼎篆韻","漢代陶文文字編_趙敏","《說文》小篆字根研究","石鼓文整理研究","里耶秦簡(貳)文字編","甲骨文可釋字形總表","新見商周金文字形編(2010-2016)","唐代隸書碑刻異體字形表","清華大學藏戰國竹簡(玖)","肩水金關漢簡(肆‧伍)字表","敦煌馬圈灣漢簡文字編","安徽大學藏戰國竹簡(一)","西周金文字編","秦漢篆字編","中國印譜","山東出土金文字形全編","漢語變調構詞考辨","章草大字典","高麗大藏經異體字典","漢字源流字典","秦簡字形表_葉書珊","漢隸異體字表","肩水金關漢簡(貳)(參)文字編","聲韻語源字彙","侯馬盟書字表_2016","甲骨文常用字字典","商周古文字源流疏證","增訂漢印文字徵","古音匯纂","商代文字字形表","《干祿字書》之形體學考察","古字通假會典","楚帛書詁林","郭店楚簡文字編","秦漢印章封泥文字編","字辨百題","東周鳥篆文字編","長沙五一廣場東漢簡牘(參)異體字表","長沙五一廣場東漢簡牘(肆)異體字表","古代漢語通假字大字典","馬王堆漢墓簡帛文字全編","金文大字典","清華大學藏戰國竹簡(拾)","戰國文字字形表","秦印文字彙編(增訂本)","ABC古代漢語詞源詞典","同源字典補","同源字典再補","漢語同源詞大典","漢碑文字通釋","古今字字典","晉系璽印彙編","上海博物館藏戰國楚竹書(一)~(六)字根研究","上博簡(七)~(九)與清華簡(壹)~(參)字根研究","清華大學藏戰國竹簡(肆)~(柒)字根研究","戰國楚簡字義通釋","甲骨文字考釋匯纂(2000-2010)","戰國文字形體混同現象研究","古璽印圖典","甲骨學辭典","篆刻全集","文源(標點本)","新編進階甲骨文字典","《文源》評注","甲骨文小字典","宋代石刻古文整理與研究","宋人著錄商周青銅器銘文文字編","遠流活用成語大辭典","商周古文字讀本(增補本)","千字文探源","東漢碑刻異體字表","常用字解","甲骨文字形表(增訂版)","商代甲骨文地名統計與地望研究","殷墟甲骨學大辭典","出土戰國文獻字詞集釋"],
		"database": "語文辭典",
		"pua": false,
		"prefix": "https://www.mebag.com/index/main/list.asp?key1=",
		"suffix": "&key3=$ENC$&key4=entry"
	},
	{
		"bookList": ["漢語大字典", "漢語大詞典", "辭源"],
		"database": "語文辭典(擴展)",
		"pua": true,
		"prefix": "https://www.mebag.com/index/main_ext/list.asp?key1=",
		"suffix": "&key3=$ENC$&key4=entry"
	},
	{
		"bookList": ["說文解字"],
		"database": "說文解字",
		"pua": false,
		"prefix": "https://www.mebag.com/index/shuowen/list.asp?key5=",
		"suffix": "&key3=$ENC$&key4=name"
	},
	{
		"bookList": ["康熙字典"],
		"database": "康熙字典",
		"pua": false,
		"prefix": "https://www.mebag.com/index/kangxi/list.asp?key5=",
		"suffix": "&key3=$ENC$&key4=name"
	}
];
